{
  "text": [
    "Got a damaged tennis racket yesterday. Need a replacement ASAP. Playing this weekend.",
    "Love my new sweater! Perfect fit and so cozy. Great purchase.",
    "These blue sneakers are amazing! The color is even better than the red I originally wanted.",
    "Missing parts from IKEA shelf. Need the screws to complete assembly.",
    "The laptop screen is cracked on arrival. Requesting replacement under warranty.",
    "Incredible customer service getting me my matching shoe so quickly! Both fit perfectly.",
    "Coffee maker leaking water from bottom. Unit is defective and needs replacement.",
    "iPhone case looks fantastic - the black actually matches my phone better!",
    "Missing charging cable for wireless headphones. Box was incomplete.",
    "Love this dress! The quality and fit are perfect. Thanks!",
    "Smartwatch band broke after first use. Need replacement under warranty.",
    "These controller buttons are so responsive - perfect for gaming!",
    "Received expired protein powder. Please send fresh batch.",
    "Wrong book edition shipped. Need the latest version for my course.",
    "Blender blade is bent and won't spin. Requesting replacement unit.",
    "Phone screen protector arrived cracked. Need new one.",
    "Missing remote control for TV. Package incomplete.",
    "Wrong voltage power adapter sent. Need 220V not 110V.",
    "Shirt buttons falling off after first wash. Quality issue.",
    "Received used yoga mat instead of new. Please exchange.",
    "Bicycle pedal broke off during first ride. Need replacement.",
    "Printer cartridge leaking ink everywhere. Defective product.",
    "Wrong sized bed frame delivered. Need queen not twin.",
    "Missing instruction manual for microwave. Cannot operate safely.",
    "Camera lens arrived with scratches. Requesting refund or replacement.",
    "Received dented cooking pot. Need undamaged replacement.",
    "Love this lavender perfume! Even better than the vanilla I originally ordered.",
    "Computer mouse scroll wheel stuck. Need working replacement.",
    "Missing power cord for speakers. Package incomplete.",
    "Jacket zipper broke first time wearing. Quality issue.",
    "Water bottle lid cracked and leaking. Need replacement.",
    "Royal blue paint color is stunning! A happy accident that worked out better.",
    "Electric toothbrush charging perfectly - keeps my teeth super clean!",
    "Received damaged picture frame. Glass is shattered.",
    "Wrong sized dog collar sent. Need large not small.",
    "Missing batteries for remote control car. Package incomplete.",
    "Tablet stylus not responding to touch. Need working replacement.",
    "Wrong phone model case shipped. Need iPhone 12 not 11.",
    "Backpack is fantastic quality! Love all the pockets and durability.",
    "Guitar strings have amazing tone! Perfect for my playing style."
  ]
}
